

{
  "filmes": [
    {
      "id": 1,
      "filme": "Viagem à Lua",
      "sinopse": "O professor Barbenfouillis (Georges Méliès) convence seus colegas a participarem de uma viagem de exploração à Lua. Eles partem em uma nave que aterrissa no olho direito da Lua. Lá eles encontram habitantes hostis que o levam ao seu rei. Os terráqueos conseguem fugir quando descobrem que os inimigos viram fumaça a um simples toque de um guarda-chuva.",
      "genero": "ficção científica, aventura",
      "trailler": "https://www.youtube.com/watch?v=5ExV_1qwgsw",
      "situacao": "Em cartaz",
      "duracao": "14 min",
      "rotten": "100%",
      "indicacao": "Livre",
      "cartaz": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/viagem%20a%20lua.jpg",
      "elenco": [
        {
          "Georges Méliès": "Professor Barbenfouillis / The Moon",
          "Bleuette Bernon": "Lady in the Moon (uncredited)",
          "Victor André": "Astronomer (uncredited)",
          "Henri Delannoy": "Captain of the Rocket (uncredited)",
          "Brunnet": "Astronomer (uncredited)"
        }
      ]
    },
    {
      "id": 2,
      "filme": "Metrópolis",
      "sinopse": "Metropolis é um filme alemão de ficção científica lançado em 1927, dirigido pelo cineasta austríaco Fritz Lang. Foi, na época, a mais cara produção até então filmada na Europa, e é considerado, por especialistas, um dos grandes expoentes do expressionismo alemão.",
      "genero": "ficção científica",
      "trailler": "https://www.youtube.com/watch?v=gdtZv3XROnc",
      "situacao": "Pré-venda",
      "duracao": "148 min",
      "rotten": "97%",
      "indicacao": "16 anos",
      "cartaz": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/metropolis.jpg",
      "elenco": [
        {
          "Rudolf Klein-Rogge": "C.A. Rotwang (inventor)",
          "Theodor Loos": "Josaphat (assessor de Fredersen)",
          "Erwin Biswanger": "Georgy (trabalhador nº 11811)",
          "Fritz Rasp": "Homem Magro (empregado de Fredersen)",
          "Heinrich Gotho": "Mestre de Cerimônias"
        }
      ]
    },
    {
      "id": 3,
      "filme": "Marinheiro Popeye encontra o marujo Simbad",
      "sinopse": "Os lendários marinheiros Popeye e Sindbad lutam para ver qual é o melhor.",
      "genero": "Fantasia/Curta-metragem",
      "trailler": "https://www.youtube.com/watch?v=l9OX7UM_HUU",
      "situacao": "Em cartaz",
      "duracao": "16 min",
      "rotten": "95%",
      "indicacao": "Livre",
      "cartaz": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/popeye.jpg"
    },
    {
      "id": 4,
      "filme": "O Gabinete do Dr. Caligari",
      "sinopse": "Em um pequeno vilarejo da fronteira holandesa, um misterioso hipnotizador, Dr. Caligari, chega acompanhado do sonâmbulo Cesare que, supostamente, estaria adormecido por 23 anos. À noite, Cesare perambula pela cidade, concretizando as previsões funestas do seu mestre, o Dr. Caligari.",
      "genero": "Terror/Mistério",
      "trailler": "https://www.youtube.com/watch?v=RueMxua6rcE",
      "situacao": "Em Cartaz",
      "duracao": "71 min",
      "rotten": "92%",
      "indicacao": "12 anos",
      "cartaz": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/dr%20caligari.jpg"
    }
  ],
  "usuarios": [
    {
      "id": 1,
      "email": "diego@gmail.com",
      "senha": "123456789",
      "telefone": "21967554477",
      "cpf": "123456789-12"
    },
    {
      "id": 2,
      "email": "camila@gmail.com",
      "senha": "987654321",
      "telefone": "21999999999",
      "cpf": "987654321-98"
    },
    {
      "id": 3,
      "email": "hudson@gmail.com",
      "senha": "abcdef1234",
      "telefone": "21888888888",
      "cpf": "111234567-89"
    },
    {
      "id": 4,
      "email": "flavia@gmail.com",
      "senha": "abcdef5678",
      "telefone": "21777777777",
      "cpf": "111222345-67"
    }
  ],

  "blog": [
    {
      "id": 1,
      "titulo": "Leonardo DiCaprio: um ícone de Hollywood e ativista ambiental",
      "conteudo": "Leonardo DiCaprio é um nome conhecido em todo o mundo, tanto por sua carreira de sucesso como ator quanto por sua atuação como ativista ambiental. Desde o início de sua carreira, DiCaprio tem sido um ator versátil e bem-sucedido, interpretando personagens em filmes de drama, comédia e ação. Alguns de seus papéis mais conhecidos incluem Jack Dawson em 'Titanic', Howard Hughes em 'Aviador' e Jordan Belfort em 'O Lobo de Wall Street'. Além de ser um ator talentoso, DiCaprio também é produtor e tem trabalhado em projetos de filmes e documentários que abordam questões ambientais e sociais importantes. DiCaprio também é um ativista ambiental dedicado e tem usado sua plataforma para chamar a atenção para questões importantes relacionadas ao meio ambiente. Ele é cofundador da Leonardo DiCaprio Foundation, que trabalha para proteger os oceanos, combater o mudança climática e promover a conservação da natureza. Além disso, ele tem participado de campanhas e eventos para sensibilizar o público sobre a importância de proteger o meio ambiente e adotar práticas mais sustentáveis. DiCaprio também tem uma paixão por filmes de temática ambiental e tem trabalhado para tornar o set de filmagem mais sustentável. Ele produziu e protagonizou o documentário 'Before the Flood', que aborda a mudança climática e os impactos que ela tem no mundo. Ele também é um defensor de tecnologias limpas e é um investidor em empresas de energias renováveis. Em resumo, Leonardo DiCaprio é um ícone de Hollywood e um ativista ambiental dedicado. Sua carreira bem-sucedida como ator e produtor é apenas um aspecto de sua contribuição para a sociedade. Ele tem usado sua plataforma para chamar a atenção para questões ambientais importantes e tem trabalhado para tornar o set de filmagem mais sustentável. Ele é um verdadeiro exemplo de como podemos usar nossa voz e plataforma para fazer a diferença na luta pelo meio ambiente.",
      "descricao": "Leonardo DiCaprio é conhecido mundialmente como um ator de sucesso, mas também é um defensor ativo da causa ambiental. Neste artigo, exploraremos a carreira de DiCaprio no cinema, suas realizações como ativista e como ele usa sua plataforma para chamar a atenção para questões ambientais importantes. Abordaremos também sua paixão por filmes de temática ambiental e como ele tem se esforçado para tornar o set de filmagem mais sustentável. DiCaprio é um verdadeiro ícone de Hollywood e um exemplo inspirador de como podemos usar nossa voz e plataforma para fazer a diferença na luta pelo meio ambiente.",
      "capa": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/dicaprio.jpg",
      "author": "Diego Fernando",
      "date": "28/12/2022"
    },

    {
      "id": 2,
      "titulo": "Passo a passo: como fazer um filme",
      "conteudo": "Fazer um filme é um processo complexo que envolve muitas etapas e decisões. Se você tem interesse em fazer um filme, este artigo é a leitura perfeita para começar a planejar e executar seu projeto. A primeira etapa na produção de um filme é a roteirização. Isso envolve escrever o roteiro, que é o guia para o filme e inclui diálogos, descrições de cenas e personagens. É importante dedicar tempo para planejar e desenvolver a história e os personagens de maneira coesa e bem estruturada. A próxima etapa é a escolha da equipe e do elenco. Isso inclui contratar diretores, produtores, câmeras, designers de produção e outros profissionais que trabalharão no filme. Também é importante escolher o elenco, ou seja, os atores que irão interpretar os personagens. Depois de ter a equipe e o elenco em ordem, é hora de captar os recursos financeiros necessários para o filme. Isso pode incluir buscar investimento de produtoras, patrocinadores ou financiamento por meio de plataformas de crowdfunding. Quando os recursos estiverem garantidos, é hora de começar a filmagem. Isso envolve escolher as locações, montar as cenas e gravar as cenas com a equipe e o elenco. É importante ter um bom planejamento e organização para garantir que tudo transcorra de forma eficiente e sem problemas. Depois de filmar as cenas, é hora de passar para a pós-produção. Isso inclui a edição, a adição de efeitos especiais e a mixagem de som. É nesta etapa que o filme começa a tomar sua forma final. Por fim, é hora de distribuir o filme. Isso pode incluir exibição em festivais de cinema, lançamento em salas de cinema ou disponibilização em plataformas de streaming. Fazer um filme é um processo longo e desafiador, mas também pode ser muito gratificante. É importante ter um bom planejamento e organização, bem como uma equipe e elenco talentosos para garantir o sucesso do projeto. Com dedicação e trabalho duro, é possível transformar sua ideia em um filme bem-sucedido.",
      "descricao": " Fazer um filme é um processo complexo que envolve muitas etapas e decisões. Neste artigo, vamos explicar como fazer um filme, desde o planejamento inicial até a finalização e lançamento. Vamos explorar tópicos como roteirização, escolha da equipe e do elenco, captação de recursos, filmagem, pós-produção e distribuição. Também vamos abordar algumas dicas e desafios que os cineastas enfrentam ao longo do processo de produção de um filme. Se você tem interesse em fazer um filme, este artigo é a leitura perfeita para começar a planejar e executar seu projeto.",
      "capa": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/filme.jpg",
      "author": "Diego Fernando",
      "date": "28/12/2022"
    },

    {
      "id": 3,
      "titulo": "Os filmes vencedores do Oscar: uma lista completa",
      "conteudo": "O Oscar é o prêmio mais prestigioso do cinema, concedido anualmente pela Academia de Artes e Ciências Cinematográficas. Desde a primeira cerimônia, em 1929, muitos filmes inesquecíveis foram reconhecidos como os melhores do ano. Neste artigo, faremos uma lista completa de todos os filmes que venceram o Oscar. Começando pela primeira cerimônia, o filme vencedor foi 'The Broadway Melody'. Desde então, muitos outros filmes memoráveis foram premiados como Melhor Filme, incluindo 'Gone with the Wind', 'The Godfather', 'Schindler's List' e 'Slumdog Millionaire'. Alguns dos diretores mais celebrados da história do cinema também foram premiados com o Oscar, como Martin Scorsese, Steven Spielberg e Francis Ford Coppola. Além da categoria de Melhor Filme e Melhor Diretor, o Oscar também premia atores e atrizes pelo seu trabalho em papéis principais e coadjuvantes. Alguns dos atores mais vencedores incluem Katharine Hepburn, Meryl Streep e Daniel Day-Lewis. Além das categorias principais, o Oscar também reconhece o trabalho de muitos profissionais do cinema em categorias menos conhecidas, como Melhor Figurino, Melhor Design de Produção e Melhor Mixagem de Som. Alguns dos filmes vencedores nestas categorias incluem 'The Great Gatsby', 'La La Land' e 'Gravity'. Esta lista de filmes vencedores do Oscar é uma oportunidade para revisitar alguns dos filmes mais memoráveis da história do cinema e entender por que eles foram escolhidos como os melhores do ano. Independentemente da época em que foram lançados, estes filmes são testemunhas da história do cinema e merecem ser lembrados e celebrados.",
      "descricao": "O Oscar é o prêmio mais prestigioso do cinema, concedido anualmente pela Academia de Artes e Ciências Cinematográficas. Neste artigo, faremos uma lista completa de todos os filmes que venceram o Oscar desde a primeira cerimônia, em 1929. Vamos explorar os filmes vencedores nas categorias principais, como Melhor Filme, Melhor Diretor e Melhor Ator, bem como algumas categorias menos conhecidas, como Melhor Figurino e Melhor Mixagem de Som. Esta lista é uma oportunidade para revisitar alguns dos filmes mais memoráveis da história do cinema e entender por que eles foram escolhidos como os melhores do ano.",
      "capa": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/oscar.jpg",
      "author": "Diego Fernando",
      "date": "28/12/2022"
    },

    {
      "id": 4,
      "titulo": "Os piores filmes da história: uma lista controversa",
      "conteudo": "Qual é o pior filme da história? Esta é uma pergunta difícil de responder, pois o gosto pessoal é subjetivo e o que é ruim para uns pode ser bom para outros. No entanto, alguns filmes têm sido consistentemente considerados os piores pela crítica e pelo público. Neste artigo, faremos uma lista dos filmes que mais têm sido condenados como os piores da história. Um dos filmes que muitas vezes é considerado o pior da história é 'Plan 9 from Outer Space', de 1959. Dirigido por Ed Wood, este filme de ficção científica é conhecido por sua má produção, atuação fraca e diálogos bizarros. Apesar de ter sido amplamente considerado um fracasso quando foi lançado, 'Plan 9 from Outer Space' tornou-se um filme cult e é agora visto por muitos como um clássico do gênero de ficção científica. Outro filme que é frequentemente mencionado como o pior da história é 'The Room', de 2003. Dirigido, escrito e protagonizado por Tommy Wiseau, este filme é conhecido por sua atuação e roteiro ruins e por sua produção desorganizada. Embora tenha sido lançado em poucas salas de cinema e tenha recebido críticas devastadoras, 'The Room' tornou-se um filme cult e é agora exibido em sessões de cinema ao redor do mundo para um público dedicado de fãs. Outros filmes que muitas vezes são mencionados como os piores da história incluem 'Gigli', 'Catwoman' e 'Batman & Robin'. Estes filmes foram amplamente condenados pela crítica e pelo público por sua produção ruim, atuação fraca e roteiros ruins. Em resumo, a lista dos piores filmes da história é controversa e subjetiva. O que é ruim para uns pode ser bom para outros. No entanto, alguns filmes têm sido consistentemente condenados como os piores da história devido à sua má produção, atuação fraca e roteiros ruins. Apesar de serem considerados fracassos quando foram lançados, muitos desses filmes tornaram-se filmes cult e são agora apreciados por um público dedicado de fãs.",
      "descricao": "Qual é o pior filme da história? Esta é uma pergunta difícil de responder, pois o gosto pessoal é subjetivo e o que é ruim para uns pode ser bom para outros. No entanto, alguns filmes têm sido consistentemente considerados os piores pela crítica e pelo público. Neste artigo, faremos uma lista dos filmes que mais têm sido condenados como os piores da história. Vamos explorar os motivos pelos quais esses filmes foram tão mal recebidos e discutir se eles realmente merecem o título de 'pior filme da história'. Atenção: este artigo pode conter spoilers!",
      "capa": "https://raw.githubusercontent.com/Diego-Fernando-Reis/json-server/master/img/piores.jpg",
      "author": "Diego Fernando",
      "date": "28/12/2022"
    }
  ],

  "enderecos": [
    {
      "id": 1,
      "nome": "Ilha Plaza Shopping",
      "endereco": "Av. Maestro Paulo e Silva, 400 - Freguesia (Ilha do Governador)",
      "cidade": " Rio de Janeiro",
      "estado": "RJ",
      "maps": "https://goo.gl/maps/V1Ly1Sww6ZeHyNke8"
    },
    {
      "id": 2,
      "nome": "Carioca Shopping",
      "endereco": "Av. Vicente de Carvalho, 909 - Vila da Penha",
      "cidade": "Rio de Janeiro",
      "estado": "RJ",
      "maps": "https://goo.gl/maps/HjQFP5Ct2Tsf8D9m6"
    },
    {
      "id": 3,
      "nome": "Madureira Shopping",
      "endereco": "Estr. do Portela, 222 - Madureira",
      "cidade": "Rio de Janeiro",
      "estado": "RJ",
      "maps": "https://goo.gl/maps/WaT6iTtYGwyDeNUk6"
    },
    {
      "id": 4,
      "nome": "Shopping Tijuca",
      "endereco": "Av. Maracanã, 987 - Tijuca",
      "cidade": "Rio de Janeiro",
      "estado": "RJ",
      "maps": "https://goo.gl/maps/3K5efYnAzxokUVfaA"
    }
  ]
}
